{
  "intents": [
    {
      "tag": "saudacao",
      "patterns": ["Oi", "Olá", "Bom dia", "Boa tarde", "E aí?", "Opa"],
      "responses": ["Olá! Eu sou o PetBot. Como posso ajudar você com seu pet hoje?", "Oi! Em que posso ajudar sobre o mundo dos pets?"]
    },
    {
      "tag": "despedida",
      "patterns": ["Tchau", "Até mais", "Até logo", "Fui", "Vou sair"],
      "responses": ["Até mais! Espero ter ajudado!", "Tchau! Volte sempre que tiver dúvidas sobre seu pet."]
    },
    {
      "tag": "agradecimento",
      "patterns": ["Obrigado", "Valeu", "Muito obrigado", "Obrigada", "Valeu pela ajuda"],
      "responses": ["Por nada! Estou aqui para ajudar.", "Não há de quê!"]
    },
    {
      "tag": "alimentacao",
      "patterns": ["O que cães podem comer?", "Qual a melhor ração?", "fale sobre alimentação", "comida", "dieta", "alimentação saudável", "posso dar carne crua para o pet?", "qual petisco natural posso dar ao meu gato?", "posso dar ovo cozido para o cachorro?"],
      "responses": ["A melhor alimentação para um pet é uma ração balanceada. Evite dar comida humana, pois muitas coisas (como chocolate, uva e cebola) são tóxicas para eles!"]
    },
    {
      "tag": "sem_resposta",
      "patterns": [],
      "responses": ["Desculpe, não entendi. Pode reformular a pergunta?", "Hmm, não tenho certeza sobre isso. Pode perguntar de outra forma?"]
    },
    {
      "tag": "vacinas",
      "patterns": ["Quando devo vacinar meu pet?", "Quais vacinas meu cachorro precisa?", "E o gato, precisa de vacina?", "Sobre vacinação", "vacinas são importantes?", "meu filhote precisa de vacinas", "Pode falar sobre vacinas?", "quais vacinas são essenciais?", "Quero saber sobre vacinas", "vacinação de cães e gatos", "quais vacinas meu gato precisa?", "quais vacinas meu cachorro precisa?", "calendário de vacinação para pets", "vacinas obrigatórias para cães e gatos", "quando começar a vacinar meu filhote?", "vacina"],
      "responses": ["A vacinação é crucial! Cães geralmente precisam da V8 ou V10 (múltipla) e da antirrábica. Gatos precisam da V3, V4 ou V5, além da antirrábica. O calendário exato deve ser definido por um veterinário, começando nos primeiros meses de vida."]
    },
    {
      "tag": "castracao_info",
      "patterns": ["Devo castrar meu pet?", "Quais as vantagens de castrar?", "A castração é boa?", "castração", "Quando posso castrar meu cachorro ou gato?", "por que castrar?", "benefícios da castração", "é caro castrar?", "cirurgia de castração", "meu pet vai engordar se castrar?", "mitos sobre castração", "castração muda o comportamento?", "é perigoso castrar?", "castração gratuita", "castração de graça", "castração na prefeitura", "como castrar no SP 156", "agendamento castração gratuita", "documentos para castração gratuita"],
      "responses": ["A castração é altamente recomendada! Ela previne várias doenças (como câncer de mama, útero e próstata) e melhora o comportamento. A Prefeitura de SP oferece o serviço gratuitamente via Portal SP 156. Você precisará de RG, CPF, comprovante de residência e o RGA do animal."]
    },
    {
      "tag": "castracao_recuperacao",
      "patterns": ["recuperação da castração", "pós-operatório castração", "cuidados depois da castração", "meu pet operado", "como é a recuperação da castração?", "o que fazer depois que meu pet castrar?", "meu cachorro castrou, e agora?", "cuidados com os pontos da castração", "meu gato operou, quais os cuidados?", "precisa usar roupa cirúrgica?", "colar elizabetano"],
      "responses": ["A recuperação exige que você **impeça** o pet de lamber os pontos. Use o colar elizabetano ou roupa cirúrgica o tempo todo! Mantenha repouso e dê a medicação prescrita. Se houver inchaço ou secreção, procure o veterinário."]
    },
    {
      "tag": "treinamento_xixi",
      "patterns": ["Como ensinar meu cachorro a fazer xixi no lugar certo?", "Meu pet faz xixi pela casa toda", "treinamento de banheiro", "xixi errado", "educar o filhote a usar o tapete"],
      "responses": ["Treinar dá trabalho, mas é possível! Limite o espaço dele no início, forre a área desejada com tapete higiênico, leve-o para lá depois de comer ou acordar, e recompense MUITO (com festa e petiscos) quando ele acertar. Nunca brigue se ele errar; apenas limpe com produtos que eliminam o odor (sem amônia)."]
    },
    {
      "tag": "pulgas_carrapatos",
      "patterns": ["Como acabar com pulgas?", "Meu pet está se coçando muito", "Achei um carrapato no meu cachorro", "pulga", "carrapato", "meu gato está com pulgas"],
      "responses": ["Pulgas e carrapatos são perigosos e transmitem doenças! Mantenha seu pet protegido com um método antipulgas (coleira, pipeta ou comprimido), que deve ser recomendado pelo seu veterinário. Lembre-se também de tratar o ambiente (sua casa), pois 95% das pulgas estão no ambiente, e não no animal."]
    },
    {
      "tag": "brinquedos",
      "patterns": ["Qual o melhor brinquedo?", "Meu cachorro destrói tudo", "Como entreter meu gato?", "enriquecimento ambiental", "brinquedo"],
      "responses": ["Brinquedos são essenciais para a saúde mental! Para cães que destroem, procure brinquedos de borracha maciça (como os recheáveis). Para gatos, varinhas com penas e brinquedos que eles possam 'caçar' são os melhores. Isso se chama 'enriquecimento ambiental' e evita o tédio e a ansiedade."]
    },
    {
      "tag": "bot_funcoes",
      "patterns": ["O que você sabe fazer?", "Quais seus comandos?", "Como você funciona?", "O que você pode me responder?", "me ajuda"],
      "responses": ["Eu sou o PetBot, um chatbot de IA treinado para classificar sua intenção! Você pode me perguntar sobre saúde (vacinas, castração), comportamento (treinamento, pulgas) e cuidados gerais com cães e gatos. Como posso ajudar?"]
    },
    {
      "tag": "comportamento_agressivo",
      "patterns": ["Meu cachorro está agressivo", "Como lidar com agressividade?", "Meu gato morde muito", "comportamento agressivo", "meu pet está atacando"],
      "responses": ["A agressividade pode ter várias causas, como medo, dor ou falta de socialização. É importante identificar o motivo antes de agir. Considere consultar um veterinário comportamentalista para uma avaliação detalhada e um plano de manejo adequado."]
    },
    {
      "tag": "alimentos_toxicos",
      "patterns": ["Meu cachorro pode comer chocolate?", "E uva, faz mal?", "Quais comidas são venenosas para gatos?", "Meu pet comeu cebola, e agora?", "lista de alimentos perigosos", "tóxico", "comida que não pode dar", "quais frutas são proibidas para pets?", "abacate é perigoso para cachorro?", "caroço de maçã faz mal?", "o que não posso dar para cães e gatos?", "alimentos proibidos"],
      "responses": ["MUITO CUIDADO! Vários alimentos humanos são tóxicos. Os piores são: chocolate, uva, uva-passa, cebola, alho, xilitol (adoçante) e abacate. Na dúvida, não ofereça comida humana e consulte um veterinário imediatamente se ele comer algo suspeito."]
    },
    {
      "tag": "higiene_banho",
      "patterns": ["Com que frequência devo dar banho?", "Posso dar banho no meu gato?", "Quando devo cortar as unhas?", "higiene do pet", "banho e tosa", "cortar unha do cachorro"],
      "responses": ["A frequência do banho depende da raça e do estilo de vida. Cães de pelo curto podem tomar banho a cada 30-45 dias. Gatos se limpam sozinhos e só precisam de banho em situações muito raras. As unhas devem ser cortadas sempre que estiverem fazendo 'clique' no chão, ou conforme orientação do veterinário ou tosador."]
    },
    {
      "tag": "sinais_doenca_urgente",
      "patterns": ["Meu cachorro está vomitando", "Meu gato está com diarreia", "Meu pet não quer comer", "Ele parece doente", "vômito", "diarreia", "não come", "meu pet está apático"],
      "responses": ["Sinto muito ouvir isso. Vômito, diarreia e perda de apetite são sinais sérios que podem indicar muitas coisas. **Eu sou apenas um bot e não posso fazer diagnósticos.** Por favor, leve seu pet ao **VETERINÁRIO** o mais rápido possível para uma avaliação correta."]
    },
    {
      "tag": "comportamento_latido_miado",
      "patterns": ["Meu cachorro late muito", "Por que meu gato mia tanto à noite?", "Como fazer o cachorro parar de latir?", "latido excessivo", "miado alto"],
      "responses": ["Latidos ou miados excessivos são uma forma de comunicação. Pode ser tédio, ansiedade de separação, fome ou para chamar sua atenção. Tente aumentar os passeios e brincadeiras (enriquecimento ambiental) para gastar energia. Se o comportamento persistir, um adestrador ou veterinário comportamentalista pode ajudar a identificar a causa."]
    },
    {
      "tag": "socializacao",
      "patterns": ["Como socializar meu filhote?", "Meu cachorro é bravo com outros cães", "Meu gato se esconde de visitas", "socialização", "apresentar meu pet para outro", "socializar meu filhote", "meu cachorro não gosta de outros cães", "meu gato tem medo de pessoas", "como ajudar meu pet a socializar?", "meu cachorro late em outros cães", "meu gato foge de visitas", "meu filhote tem medo de tudo", "meu pet é tímido", "meu cachorro é agressivo com outros cães", "meu gato não gosta de outros gatos"],
      "responses": ["A socialização é fundamental, especialmente nos primeiros meses de vida. Apresente seu filhote a diferentes pessoas, sons e outros animais (sempre vacinados!) de forma calma e positiva. Para gatos, ofereça lugares altos e seguros para eles observarem à distância. Forçar a interação pode piorar o medo, então vá com calma e paciência."]
    },
    {
      "tag": "passeio_caes",
      "patterns": ["Quantas vezes devo passear?", "passeio", "passear com o cachorro", "dicas para passear", "meu cachorro precisa passear todo dia?", "frequência de passeio do cão", "Pode passear com filhote?"],
      "responses": ["Passeios são essenciais para cães! O ideal é 2 a 3 vezes por dia, em horários frescos. Filhotes só podem ir à rua após todas as vacinas."]
    },
    {
      "tag": "passeio_gatos",
      "patterns": ["Pode passear com gato?", "É bom passear com gato na coleira?", "gato pode passear?", "como passear com meu gato", "gatos precisam passear?", "passeio com gato", "meu gato quer sair na rua"],
      "responses": ["Gatos geralmente não precisam passear. Se quiser tentar, use coleira peitoral e vá com calma. Nunca force."]
    },
    {
      "tag": "viagem_pet",
      "patterns": ["Posso viajar com meu pet?", "Como levar meu cachorro no avião?", "viagem de carro com gato", "o que precisa para viajar com animal?", "transporte pet"],
      "responses": ["Viajar com pets exige muito planejamento! Para viagens de carro, use sempre uma caixa de transporte ou cinto de segurança específico. Para viagens de avião, cada companhia aérea tem regras rígidas sobre tamanho, raça e documentação (atestado de saúde, vacinas em dia). Verifique tudo com a companhia e o veterinário com muita antecedência."]
    },
    {
      "tag": "saude_dental",
      "patterns": ["meu cachorro tá com bafo", "gato com mau hálito", "como escovar os dentes do pet", "precisa limpar o dente do cachorro?", "tártaro no dente", "hálito do pet"],
      "responses": ["A saúde dental é crucial! O mau hálito (bafo) geralmente é causado por bactérias e acúmulo de tártaro. O ideal é escovar os dentes do seu pet regularmente (com pasta de dente veterinária, NUNCA humana!). Se o tártaro já estiver visível, uma limpeza no veterinário pode ser necessária."]
    },
    {
      "tag": "pet_idoso",
      "patterns": ["meu cachorro está velho", "cuidados com pet idoso", "quando um cão é considerado idoso?", "meu gato é senior", "meu pet está com dor para andar", "artrose em cães"],
      "responses": ["Pets idosos (seniors) precisam de cuidados especiais! Cães de porte grande são idosos a partir dos 6-7 anos, e pequenos/gatos a partir dos 8-10 anos. Eles precisam de exames de sangue mais frequentes (check-ups), uma cama mais confortável, e talvez ajustes na dieta ou medicação para dor nas articulações (artrose)."]
    },
    {
      "tag": "filhote_cuidados",
      "patterns": ["peguei um filhote, e agora?", "primeiros cuidados com filhote", "o que um filhote precisa?", "posso sair com meu filhote na rua?", "quando o filhote pode passear?", "filhote", "filhotes", "adotei um filhote", "cuidados filhote de cachorro", "cuidados filhote de gato"],
      "responses": ["Parabéns pelo novo membro da família! O cuidado mais importante nas primeiras semanas é: **NÃO SAIA NA RUA** ou tenha contato com outros animais até ele completar o primeiro ciclo de vacinas (dado pelo veterinário). Isso é vital para protegê-lo de doenças fatais. Mantenha-o aquecido, com ração de filhote e agende a primeira visita ao veterinário."]
    },
    {
      "tag": "comportamento_roer",
      "patterns": ["meu cachorro comeu meu sapato", "ele rói os móveis", "como fazer parar de roer as coisas?", "filhote roendo tudo", "meu cachorro é destruidor"],
      "responses": ["Roer é um comportamento natural, especialmente para filhotes trocando os dentes ou cães entediados. A solução é dupla: 1) Ofereça brinquedos muito mais interessantes (mordedores, ossos de nylon, brinquedos recheáveis) e 2) Aumente os passeios e o gasto de energia. Nunca brigue, apenas redirecione o comportamento para o brinquedo correto."]
    },
    {
      "tag": "pelo_caindo",
      "patterns": ["meu pet solta muito pelo", "pelo caindo demais", "queda de pelo", "como diminuir a queda de pelo?", "época de muda de pelo"],
      "responses": ["Todos os pets soltam pelo (exceto raças específicas). Muitos têm 'mudas' sazonais (na primavera e outono) onde a queda piora. A escovação regular (diária, se possível) é a melhor forma de remover o pelo morto e evitar que ele caia pela casa. Se a queda for em tufos, criar falhas na pele ou vier com coceira, procure um veterinário, pois pode ser alergia ou outra doença."]
    },
    {
      "tag": "alergia_pele",
      "patterns": ["meu cachorro se coça o tempo todo", "pata vermelha", "meu gato tem alergia?", "coceira", "dermatite", "meu cão está lambendo muito as patas"],
      "responses": ["Coceira excessiva (especialmente lamber as patas, coçar orelhas e barriga) é um forte sinal de alergia. As causas mais comuns são: 1) Alergia a picada de pulgas (DAPP), 2) Alergia alimentar (à ração) ou 3) Dermatite atópica (alergia a ácaros, pólen, etc.). Não dê remédios caseiros. É essencial levar ao veterinário para um diagnóstico correto."]
    },
    {
      "tag": "comportamento_pedir_comida",
      "patterns": ["meu cachorro fica pedindo comida na mesa", "ele chora por comida", "como fazer o pet parar de pedir?", "meu gato fica miando por comida", "pedinte"],
      "responses": ["O pet 'pedinte' é um comportamento que *nós* (humanos) ensinamos sem querer! A regra de ouro para corrigir isso é: **NUNCA** dê comida da sua mesa ou fora dos horários. Ignore o comportamento (não olhe, não fale, não brigue). Ele precisa aprender que a comida dele vem apenas no pote dele, no horário dele."]
    },
    {
      "tag": "limpeza_orelha",
      "patterns": ["como limpar a orelha do meu cachorro?", "meu pet está balançando muito a cabeça", "cera no ouvido", "otite", "orelha do meu gato está suja"],
      "responses": ["Limpar as orelhas é importante, especialmente em raças com orelhas caídas (como Cockers e Bassets). Use apenas soluções de limpeza específicas para pets (vendidas em pet shops). Molhe um algodão (nunca cotonete!) com a solução e limpe suavemente a parte visível da orelha. Se ele balança muito a cabeça ou a orelha está vermelha e cheirando mal, pode ser otite (infecção) e ele precisa de um veterinário."]
    },
    {
      "tag": "hospital_publico",
      "patterns": ["hospitais publicos", "hospital veterinario publico", "atendimento veterinario gratuito", "onde levar meu pet de graça", "existe veterinario de graça?", "veterinario 0800", "hospital para pet gratuito"],
      "responses": ["Aqui estão os endereços dos hospitais veterinários públicos em São Paulo (todos exigem triagem social obrigatória na recepção):\n\n* **Unidade Leste:** Av. Salim Farah Maluf, esquina com R. Ulisses Cruz, lado par – Tatuapé.\n* **Unidade Norte:** Rua Atílio Piffer, 687 - Casa Verde.\n* **Unidade Sul:** Rua Agostino Togneri, n° 153 – Jurubatuba.\n* **Unidade Oeste:** Av. Professor Orlando Marques de Paiva, 87 – Butantã (USP)."]
    },
    {
      "tag": "vermes",
      "patterns": ["quando dar remédio de verme?", "vi verme nas fezes", "meu pet precisa de vermífugo?", "parasitas intestinais"],
      "responses": ["Sim, todos os pets precisam de vermífugo regularmente! Filhotes tomam várias doses no início. Adultos geralmente tomam a cada 3, 6 ou 12 meses, dependendo do estilo de vida (se passeiam muito na rua, comem coisas do chão, etc.). O veterinário irá recomendar o melhor remédio e a frequência correta para o seu pet."]
    },
    {
      "tag": "remedio_humano_perigo",
      "patterns": [
        "posso dar dipirona pro meu cachorro?", 
        "meu gato tá com dor, posso dar paracetamol?", 
        "posso dar ibuprofeno?", 
        "remédio de gente para pet",
        "remedios proibidos", 
        "remédios" 
      ],
      "responses": ["**NUNCA DÊ MEDICAÇÃO HUMANA PARA SEU PET SEM ORDEM EXPRESSA DE UM VETERINÁRIO!** Muitos remédios comuns para nós são **EXTREMAMENTE TÓXICOS** para eles. Paracetamol, por exemplo, é **FATAL** para gatos. Ibuprofeno é tóxico para cães. Não arrisque a vida do seu animal, procure sempre um profissional."]
    },
    {
      "tag": "gato_caixa_areia",
      "patterns": ["meu gato está fazendo xixi fora da caixa", "meu gato não usa a caixa de areia", "por que meu gato está fazendo xixi no sofá?", "xixi de gato no lugar errado", "problema na caixa de areia", "quantas caixas de areia eu preciso?", "onde devo colocar a caixa de areia?"],
      "responses": ["Se o gato parou de usar a caixa, pode ser doença (infecção urinária) ou caixa suja. Regra: tenha 1 caixa a mais que o número de gatos e limpe diariamente."]
    },
    {
      "tag": "gato_arranhar",
      "patterns": ["meu gato arranha o sofá", "como fazer o gato parar de arranhar os móveis", "arranhador para gato", "gato arranhando a porta", "gato arranhando a cama", "por que o gato arranha?"],
      "responses": ["Gatos precisam arranhar. Não proíba, redirecione! Coloque arranhadores (papelão ou sisal) bem ao lado de onde ele está estragando o móvel."]
    },
    {
      "tag": "gato_bola_pelo",
      "patterns": ["meu gato está tossindo", "bola de pelo", "como evitar bola de pelo", "gato vomitando pelo", "gato se lambendo muito", "pasta de malt", "graminha de gato"],
      "responses": ["Bolas de pelo são comuns. Escove seu gato diariamente e ofereça 'graminha' ou pasta de 'malt' para ajudar na digestão."]
    },
    {
      "tag": "gato_agua",
      "patterns": ["meu gato não bebe água", "como fazer meu gato beber mais água", "pote de água do gato", "gato bebendo pouca água", "fonte de água para gato"],
      "responses": ["Gatos bebem pouca água por natureza. Use fontes de água corrente e espalhe potes pela casa (longe da comida!) para evitar problemas renais."]
    },
    {
      "tag": "gato_tela_seguranca",
      "patterns": ["gato pode sair na rua?", "preciso telar minhas janelas?", "meu gato fica na janela", "é perigoso deixar o gato sair?", "tela de segurança", "rede de proteção para gatos"],
      "responses": ["SIM! É essencial telar todas as janelas. Gatos caçadores podem cair. Lugar de gato é dentro de casa para evitar atropelamentos, brigas e doenças."]
    },
    {
      "tag": "gato_comportamento_dormir",
      "patterns": ["meu gato dorme o dia todo", "é normal gato dormir tanto?", "quantas horas um gato dorme?", "meu gato parece preguiçoso", "meu gato só dorme"],
      "responses": ["Normalíssimo! Gatos dormem de 12 a 16 horas por dia. Se ele come e brinca nos momentos acordado, está tudo bem."]
    },
    {
      "tag": "ansiedade_separacao",
      "patterns": ["meu cachorro chora quando eu saio", "ele destrói a casa quando fica sozinho", "meu pet tem ansiedade de separação", "como tratar ansiedade de separação", "gato miando muito quando fica sozinho", "meu pet sofre quando eu saio"],
      "responses": ["A Ansiedade de Separação é angustiante. Dicas: Cansar o pet antes de sair, deixar brinquedos recheados (Kongs) e não fazer 'festa' ao sair ou chegar. Treine saídas curtas."]
    },
    {
      "tag": "dog_puxar_guia",
      "patterns": ["meu cachorro me puxa muito no passeio", "como fazer o cachorro andar junto", "ele não para de puxar a coleira", "meu cachorro me arrasta na rua", "andar do lado na guia"],
      "responses": ["Se ele puxar, PARE imediatamente. Só ande quando a guia afrouxar. Use peitoral antipuxão (com argola na frente) e recompense quando ele andar ao lado."]
    },
    {
      "tag": "dog_cavar",
      "patterns": ["meu cachorro cava o quintal", "por que o cachorro cava buraco?", "como parar de cavar", "cachorro cavando o sofá", "cachorro cavando a cama", "meu cachorro destrói o jardim"],
      "responses": ["Cavar é instinto! Pode ser tédio ou calor. Aumente os passeios e, se possível, dê a ele um lugar permitido para cavar (caixa de areia/terra) escondendo brinquedos lá."]
    },
    {
      "tag": "introducao_novo_pet",
      "patterns": ["peguei um novo cachorro, como apresentar pro antigo?", "meu cachorro e meu gato não se dão bem", "apresentar gato e cão", "como introduzir um novo filhote", "meus pets estão brigando", "adaptação novo pet"],
      "responses": ["Introduza devagar! 1) Apresente cães em local neutro (rua). 2) Em casa, mantenha separados e troque panos com o cheiro de cada um. 3) Deixe se verem de longe. 4) Associe a presença do outro com petiscos."]
    },
    {
      "tag": "microchip",
      "patterns": ["o que é microchip?", "preciso microchipar meu pet?", "microchip vale a pena?", "como funciona o microchip?", "identificação do pet", "microchipagem"],
      "responses": ["O microchip é um 'RG' sob a pele. Não é GPS! Se o pet se perder, qualquer vet pode ler o chip e achar seus dados. É muito seguro e recomendado."]
    },
    {
      "tag": "alimentos_seguros",
      "patterns": ["posso dar maçã pro meu cachorro?", "cenoura faz bem?", "quais frutas o pet pode comer?", "comida humana que pode dar", "quais legumes posso dar pro meu pet?", "pode dar banana?", "pode dar melancia?", "quais alimentos naturais meu cachorro pode comer?", "o que posso dar de comida natural para o gato?", "comidas saudáveis para pets", "qual petisco natural posso dar ao meu gato?", "posso dar ovo cozido para o cachorro?", "comidas permitidas", "alimentos permitidos"],
      "responses": ["Seguros (com moderação!): Maçã (sem semente!), banana, cenoura, abóbora cozida, melancia e brócolis. Gatos podem comer carne cozida sem tempero e ovo. Petiscos não devem passar de 10% da dieta."]
    },
    {
      "tag": "refrescar_pets",
      "patterns": ["como refrescar meu cachorro no calor?", "meu gato está com muito calor", "cuidados com pet no verão", "posso dar gelo para meu cachorro?", "cachorro ofegante demais", "como aliviar o calor do pet", "dicas para dias quentes", "pode molhar o gato no calor?", "insolação em pets"],
      "responses": ["No calor: Água fresca sempre (pode por gelo!), evite passeios entre 10h e 16h (asfalto quente!), use tapetes gelados ou toalhas úmidas. Para gatos: fontes de água e sachê gelado."]
    },
    {
      "tag": "aquecer_pets",
      "patterns": ["como esquentar meu cachorro no frio?", "meu gato está com frio", "cuidados com pet no inverno", "gato sente frio?", "como proteger o pet do frio", "cachorro tremendo de frio", "cama para pet no inverno"],
      "responses": ["Para o frio e inverno: Garanta que seu pet tenha uma área de descanso protegida do vento e da umidade. Cães idosos e de pelo curto sentem mais frio. Mantenha as caminhas aquecidas com cobertores. **Use roupas apenas se o pet tolerar e se for realmente necessário, complementando a proteção.**"]
    },
    {
      "tag": "roupa_geral",
      "patterns": ["roupa para cachorro", "cachorro usa roupa", "roupa para cães é útil?", "roupa para cães é bom?", "qual a utilidade da roupa para cães?", "roupa faz mal?", "roupa faz mal para o cachorro?", "roupa para pet é só enfeite?", "como saber se meu cachorro está bem com a roupa?", "cuidados com a roupa do pet", "a roupa pode dar alergia na pele do pet?", "meu cachorro pode usar roupa?"],
      "responses": ["Roupas podem ajudar cães idosos ou de pelo curto a se aquecerem no frio. **Atenção:** A roupa deve ser do tamanho correto e retirada diariamente para inspecionar a pele. Roupa de material inadequado ou úmida pode causar alergia ou dermatite. Nunca force o pet a usar."]
    },
    {
      "tag": "ambiente_saudavel",
      "patterns": ["Como criar um ambiente saudável para o pet?", "o que fazer para enriquecimento ambiental do pet?", "como garantir a segurança do pet no quintal?", "como deixar o ambiente saudável para gatos?", "o que é enriquecimento ambiental?", "rotina é importante para o pet?"],
      "responses": ["Um ambiente saudável envolve segurança (sem tóxicos), higiene e enriquecimento mental, como brinquedos e passeios. A rotina também é fundamental para o bem-estar emocional."]
    }
  ]
}